-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Host: mysql
-- Generation Time: Jun 25, 2025 at 02:54 AM
-- Server version: 8.0.42
-- PHP Version: 7.4.15

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `volleyballdb`
--

-- --------------------------------------------------------

--
-- Table structure for table `Players`
--

CREATE TABLE `Players` (
  `player_id` int NOT NULL,
  `name` varchar(50) COLLATE utf8mb3_unicode_ci DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `height` float DEFAULT NULL,
  `weight` float DEFAULT NULL,
  `position` varchar(50) COLLATE utf8mb3_unicode_ci DEFAULT NULL,
  `eng_position` varchar(50) COLLATE utf8mb3_unicode_ci DEFAULT NULL,
  `captain` tinyint DEFAULT NULL,
  `national_team` tinyint DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_unicode_ci;

--
-- Dumping data for table `Players`
--

INSERT INTO `Players` (`player_id`, `name`, `birthday`, `height`, `weight`, `position`, `eng_position`, `captain`, `national_team`) VALUES
(84, '黃宇晨', '1999-10-30', 188, 83, '舉球', 'Setter', 0, 0),
(85, '李佳軒', '1993-09-06', 175, 70, '自由', 'Libero', 1, 1),
(86, '莊邵捷', '1994-10-18', 195, 82, '攔中', 'Middle Blocker', 0, 1),
(87, '林祐廷', '2005-10-12', 185, 78, '舉球', 'Setter', 0, 0),
(88, '曾茂聰', '2002-03-20', 188, 84, '對角', 'Opposite Hitter', 0, 0),
(89, '陳裕仁', '2002-05-29', 188, 80, '舉球', 'Setter', 0, 0),
(90, '洪宇叡', '2003-09-21', 188, 86, '長攻', 'Outside Hitter', 0, 0),
(91, '曾祥銘', '2002-02-16', 194, 75, '長攻', 'Outside Hitter', 0, 1),
(92, '畢宗元', '2006-06-23', 193, 92, '攔中', 'Middle Blocker', 0, 0),
(93, '鄭偉志', '2005-08-04', 186, 70, '長攻', 'Outside Hitter', 0, 0),
(94, '許紋誠', '1996-06-30', 188, 88, '長攻', 'Outside Hitter', 0, 1),
(95, '林宜暉', '1997-02-19', 195, 90, '攔中', 'Middle Blocker', 0, 1),
(96, '顏振富', '1997-10-28', 198, 94, '攔中', 'Middle Blocker', 0, 1),
(97, '詹旻翰', '1997-05-18', 191, 90, '長攻', 'Outside Hitter', 0, 1),
(98, '李瑋軒', '2001-01-18', 170, 63, '自由', 'Libero', 0, 0),
(99, '黃正良', '1998-02-17', 192, 90, '對角', 'Opposite Hitter', 0, 1),
(100, '蘇逢澤', '2003-04-01', 164, 70, '自由', 'Libero', 0, 1),
(101, '莊岳祥', '2002-10-05', 183, 85, '對角', 'Opposite Hitter', 0, 0),
(102, '吳承翰', '2004-08-07', 177, 77, '對角', 'Opposite Hitter', 0, 0),
(103, '李赫軒', '2005-02-23', 166, 57, '自由', 'Libero', 0, 0),
(104, '張祐晨', '2002-05-22', 188, 80, '長攻', 'Outside Hitter', 1, 0),
(105, '莊皓崴', '2004-10-24', 173, 70, '舉球', 'Setter', 0, 0),
(106, '許美中', '1991-10-16', 190, 92, '長攻', 'Outside Hitter', 0, 1),
(107, '何京威', '2004-08-28', 183, 70, '長攻', 'Outside Hitter', 0, 0),
(108, '許睿恩', '2002-02-05', 193, 73, '攔中', 'Middle Blocker', 0, 0),
(109, '李俊佑', '2004-09-30', 188, 87, '攔中', 'Middle Blocker', 0, 0),
(110, '林嘉偉', '2003-09-06', 177, 70, '舉球', 'Setter', 0, 0),
(111, '林裕鈞', '2003-12-20', 189, 80, '攔中', 'Middle Blocker', 0, 0),
(112, '洪榮發', '2000-11-22', 188, 90, '對角', 'Opposite Hitter', 0, 1),
(113, '溫逸凱', '2003-02-05', 187, 83, '長攻', 'Outside Hitter', 0, 0),
(114, '陳昱碩', '2002-02-03', 177, 80, '長攻', 'Outside Hitter', 0, 0),
(115, '陳朝璽', '2001-12-05', 180, 70, '舉球', 'Setter', 0, 0),
(116, '郭柏毅', '2003-05-12', 185, 72, '舉球', 'Setter', 0, 0),
(117, '李元', '2004-07-17', 186, 78, '長攻', 'Outside Hitter', 0, 0),
(118, '王俊傑', '2001-10-28', 184, 75, '攔中', 'Middle Blocker', 0, 0),
(119, '廖閎昇', '2003-05-09', 192, 85, '攔中', 'Middle Blocker', 0, 0),
(120, '林聖恩', '2003-01-02', 175, 70, '長攻', 'Outside Hitter', 0, 0),
(121, '鄭聖叡', '2004-09-10', 183, 67, '對角', 'Opposite Hitter', 0, 0),
(122, '張皓博', '2005-06-29', 189, 75, '長攻', 'Outside Hitter', 0, 0),
(123, '陳佑誠', '2005-07-11', 174, 64, '自由', 'Libero', 0, 0),
(124, '洪晨祐', '2003-11-19', 172, 58, '自由', 'Libero', 0, 0),
(125, '張家瑋', '2002-09-21', 172, 60, '舉球', 'Setter', 0, 0),
(126, '周冠宇', '2001-04-21', 185, 70, '對角', 'Opposite Hitter', 1, 0),
(127, '楊承恩', '2004-01-05', 193, 92, '攔中', 'Middle Blocker', 0, 0),
(128, '雷諾', '2002-10-29', 194, 89, '長攻', 'Outside Hitter', 0, 1),
(129, '林暘程', '2004-04-19', 192, 81, '攔中', 'Middle Blocker', 0, 0),
(130, '黃韋程', '1992-03-02', 183, 86, '舉球', 'Setter', 1, 0),
(131, '陳恩得', '2004-03-24', 190, 78, '對角', 'Opposite Hitter', 0, 0),
(132, '陳昭銘', '1996-01-20', 190, 82, '長攻', 'Outside Hitter', 0, 0),
(133, '高偉誠', '1995-10-29', 182, 68, '長攻', 'Outside Hitter', 0, 1),
(134, '簡偉倫', '1989-02-06', 170, 64, '自由', 'Libero', 0, 1),
(135, '高得益', '1994-11-07', 185, 86, '舉球', 'Setter', 0, 0),
(136, '黃柏叡', '2001-06-30', 176, 70, '自由', 'Libero', 0, 0),
(137, '林昱丞', '1999-11-07', 196, 85, '攔中', 'Middle Blocker', 0, 0),
(138, '施宗諭', '2002-11-02', 187, 78, '攔中', 'Middle Blocker', 0, 0),
(139, '李修瑜', '2002-02-27', 173, 58, '長攻', 'Outside Hitter', 0, 0),
(140, '柯宗甫', '2000-07-09', 192, 85, '攔中', 'Middle Blocker', 0, 1),
(141, '林韋翔', '2003-11-11', 193, 80, '攔中', 'Middle Blocker', 0, 0),
(142, '黃士展', '1999-04-29', 180, 85, '長攻', 'Outside Hitter', 0, 0),
(143, '焦璿誠', '1999-06-09', 183, 80, '長攻', 'Outside Hitter', 0, 0),
(144, '施宇祥', '2004-11-22', 182, 77, '長攻', 'Outside Hitter', 0, 0),
(145, '林謙', '2002-04-04', 190, 73, '舉球', 'Setter', 0, 1),
(146, '林義祥', '2003-11-17', 182, 79, '舉球', 'Setter', 0, 0),
(147, '甘茂宏', '2003-05-29', 191, 79, '攔中', 'Middle Blocker', 0, 0),
(148, '林錦龍', '2001-01-19', 194, 86, '對角', 'Opposite Hitter', 0, 1),
(149, '劉昱麟', '2003-12-03', 193, 73, '長攻', 'Outside Hitter', 0, 0),
(150, '張安成', '2005-07-07', 192, 75, '攔中', 'Middle Blocker', 0, 0),
(151, '高宇浩', '2005-08-26', 183, 70, '長攻', 'Outside Hitter', 0, 0),
(152, '陳冠中', '2000-10-16', 188, 78, '攔中', 'Middle Blocker', 0, 0),
(153, '陳柏勳', '2003-09-22', 171, 72, '自由', 'Libero', 0, 0),
(154, '劉少宇', '2003-05-26', 187, 75, '舉球', 'Setter', 0, 0),
(155, '黃意凱', '2001-09-10', 173, 65, '自由', 'Libero', 0, 0),
(156, '郭其昌', '2003-09-30', 183, 83, '長攻', 'Outside Hitter', 0, 0),
(157, '李權紘', '2001-11-10', 190, 83, '對角', 'Opposite Hitter', 0, 0),
(158, '李尼希米', '2002-03-30', 180, 70, '長攻', 'Outside Hitter', 1, 1),
(159, '胡曉佩', '2001-11-30', 176, 66, '攔中', 'Middle Blocker', 0, 1),
(160, '劉玉淳', '2000-05-10', 173, 70, '舉球', 'Setter', 0, 0),
(161, '曾琬羚', '1996-05-13', 171, 64, '攔中', 'Middle Blocker', 1, 1),
(162, '陳思妤', '2005-02-03', 174, 75, '長攻', 'Outside Hitter', 0, 0),
(163, '吳閩育', '2003-12-09', 155, 55, '自由', 'Libero', 0, 0),
(164, '洪詩涵', '2004-09-23', 181, 74, '對角', 'Opposite Hitter', 0, 1),
(165, '許菀芸', '2003-05-10', 164, 57, '長攻', 'Outside Hitter', 0, 1),
(166, '包茵綺', '2006-07-16', 178, 72, '攔中', 'Middle Blocker', 0, 0),
(167, '許惠瑩', '2002-06-10', 177, 66, '長攻', 'Outside Hitter', 0, 0),
(168, '鍾虹薰', '2003-01-19', 160, 48, '自由', 'Libero', 0, 0),
(169, '黃瀞萱', '1998-11-16', 181, 71, '對角', 'Opposite Hitter', 0, 1),
(170, '葉軒岑', '2002-02-19', 173, 68, '攔中', 'Middle Blocker', 0, 0),
(171, '欒妤雯', '2002-07-23', 172, 58, '舉球', 'Setter', 0, 0),
(172, '丁柔安', '1997-01-31', 160, 50, '自由', 'Libero', 0, 0),
(173, '陳怡如', '1989-12-21', 175, 67, '攔中', 'Middle Blocker', 0, 0),
(174, '高歆媛', '2002-09-28', 172, 67, '長攻', 'Outside Hitter', 0, 0),
(175, '江思萳', '1998-09-01', 168, 66, '攔中', 'Middle Blocker', 0, 0),
(176, '蔡幼群', '2001-07-20', 174, 58, '長攻', 'Outside Hitter', 0, 1),
(177, '吳詠涵', '2004-05-05', 166, 66, '長攻', 'Outside Hitter', 0, 0),
(178, '陳菀婷', '1990-11-25', 180, 70, '對角', 'Opposite Hitter', 1, 0),
(179, 'Carla Santos', '1992-01-17', 173, 75, '長攻', 'Outside Hitter', 0, 0),
(180, '黃素琴', '2000-09-01', 167, 62, '自由', 'Libero', 0, 0),
(181, 'Aleoscar Blanco', '1987-07-18', 189, 89, '攔中', 'Middle Blocker', 0, 0),
(182, '詹佳茵', '2003-02-14', 165, 52, '長攻', 'Outside Hitter', 0, 0),
(183, '吳沛緹', '2004-12-19', 167, 61, '長攻', 'Outside Hitter', 0, 0),
(184, '鄭伊伶', '2003-11-18', 173, 60, '長攻', 'Outside Hitter', 0, 0),
(185, '黃珮甄', '2004-03-02', 176, 69, '對角', 'Opposite Hitter', 0, 0),
(186, '洪家瑤', '2004-01-07', 177, 77, '舉球', 'Setter', 0, 1),
(187, '謝靖瑩', '2003-09-02', 172, 73, '舉球', 'Setter', 0, 0),
(188, '江昀庭', '2005-05-08', 160, 53, '自由', 'Libero', 0, 0),
(189, '廖嘉安', '2004-04-15', 177, 75, '攔中', 'Middle Blocker', 0, 1),
(190, '張稦豈', '2005-07-19', 180, 65, '對角', 'Opposite Hitter', 0, 0),
(191, '張洵瑞', '2004-10-12', 170, 61, '舉球', 'Setter', 0, 0),
(192, '胡宸穎', '2004-07-03', 173, 64, '攔中', 'Middle Blocker', 1, 0),
(193, '李思依', '2006-02-15', 168, 55, '自由', 'Libero', 0, 0),
(194, '李子嫣', '2004-07-02', 174, 66, '攔中', 'Middle Blocker', 0, 0),
(195, '吳佩茹', '2004-06-22', 171, 69, '長攻', 'Outside Hitter', 0, 0),
(196, '潘宣蓉', '2003-09-18', 182, 69, '攔中', 'Middle Blocker', 0, 0),
(197, 'POLINA KOCHETKOVA', '2000-03-16', 188, 70, '對角', 'Opposite Hitter', 0, 0),
(198, 'Beatriz De Carvalho', '1998-12-18', 175, 78, '對角', 'Opposite Hitter', 0, 0),
(199, '廖苡任', '1997-06-08', 166, 51, '舉球', 'Setter', 1, 1),
(200, '吳芳妤', '2000-01-09', 170, 57, '長攻', 'Outside Hitter', 0, 1),
(201, '丁佩瑩', '2003-07-13', 168, 70, '自由', 'Libero', 0, 0),
(202, '林良黛', '2005-01-09', 170, 63, '長攻', 'Outside Hitter', 0, 0),
(203, '王育文', '2004-01-24', 176, 65, '攔中', 'Middle Blocker', 0, 0),
(204, '陳莉鎔', '2001-02-23', 167, 58, '舉球', 'Setter', 0, 0),
(205, '翁梓勻', '2005-06-08', 176, 62, '攔中', 'Middle Blocker', 0, 0),
(206, '林書荷', '1999-02-06', 171, 62, '長攻', 'Outside Hitter', 0, 1),
(207, '陳佳蔓', '1999-07-27', 172, 62, '舉球', 'Setter', 1, 1),
(208, '甘可慧', '2002-09-03', 188, 86, '攔中', 'Middle Blocker', 0, 1),
(209, '陳潔', '2001-12-01', 165, 63, '對角', 'Opposite Hitter', 0, 1),
(210, '陳莉鈞', '2003-03-07', 170, 61, '長攻', 'Outside Hitter', 0, 1),
(211, '許恆芸', '2005-11-29', 175, 63, '對角', 'Opposite Hitter', 0, 0),
(212, '劉雙菱', '2000-04-04', 177, 66, '長攻', 'Outside Hitter', 0, 1),
(213, '邱詩晴', '2004-01-25', 155, 50, '自由', 'Libero', 0, 1),
(214, '劉美菁', '1996-01-17', 186, 72, '攔中', 'Middle Blocker', 0, 0),
(215, '池長璇', '2004-06-21', 178, 60, '長攻', 'Outside Hitter', 0, 0),
(216, '李怡萱', '1992-08-02', 166, 57, '自由', 'Libero', 0, 0),
(217, '蔡沛彰', '2001-01-02', 198, 90, '攔中', 'Middle Blocker', 0, 1),
(218, '陳政錡', '1999-01-29', 192, 85, '攔中', 'Middle Blocker', 0, 1),
(219, '戴儒謙', '1988-11-14', 182, 77, '舉球', 'Setter', 1, 1),
(220, '柯凱傑', '1998-10-15', 190, 72, '舉球', 'Setter', 0, 1),
(221, '吳宗軒', '1994-07-09', 187, 75, '對角', 'Opposite Hitter', 0, 1),
(222, '宋柏霆', '1998-09-02', 186, 78, '長攻', 'Outside Hitter', 0, 1),
(223, '吳政陽', '1992-06-03', 188, 72, '攔中', 'Middle Blocker', 0, 1),
(224, '陳建禎', '1989-11-20', 187, 87, '長攻', 'Outside Hitter', 1, 1),
(225, '張育陞', '2000-03-30', 188, 84, '對角', 'Opposite Hitter', 0, 1),
(226, '張昀亮', '1998-08-28', 167, 70, '自由', 'Libero', 0, 1),
(227, '劉鴻杰', '1993-11-10', 189, 80, '攔中', 'Middle Blocker', 0, 1),
(228, '劉鴻敏', '1993-11-10', 191, 85, '長攻', 'Outside Hitter', 0, 1),
(229, '林國鈞', '1993-04-11', 189, 72, '舉球', 'Setter', 0, 1),
(230, '李興國', '1995-09-20', 191, 75, '對角', 'Opposite Hitter', 0, 1),
(231, '董力億', '1994-10-10', 165, 62, '自由', 'Libero', 0, 1),
(232, '張良皓', '1994-07-07', 196, 86, '攔中', 'Middle Blocker', 0, 1),
(233, '江天祐', '1988-02-07', 196, 95, '攔中', 'Middle Blocker', 0, 1),
(234, '黃建逢', '1990-12-31', 195, 82, '長攻', 'Outside Hitter', 0, 1),
(235, '黃鈞璟', '1993-03-22', 196, 88, '攔中', 'Middle Blocker', 0, 1),
(236, '王明浚', '1988-07-30', 188, 85, '對角', 'Opposite Hitter', 0, 1),
(237, '林雍順', '1991-10-13', 172, 68, '自由', 'Libero', 0, 1),
(238, '黃培閎', '1990-09-17', 188, 74, '舉球', 'Setter', 0, 1),
(239, '石修智', '1995-07-24', 184, 77, '舉球', 'Setter', 0, 1),
(240, '曾弘仁', '1996-12-23', 190, 94, '長攻', 'Outside Hitter', 0, 1),
(241, '陳姿雅', '1997-08-26', 177, 62, '長攻', 'Outside Hitter', 1, 1),
(242, '林靖儀', '2001-12-10', 166, 67, '舉球', 'Setter', 0, 1),
(243, '林其蓉', '2000-10-05', 158, 59, '自由', 'Libero', 0, 1),
(244, '許晏寧', '2004-01-01', NULL, NULL, '攔中', 'Middle Blocker', 0, 1),
(245, '林其蓉', '2000-10-05', 158, 59, '自由', 'Libero', 0, 1),
(246, '黃蔓亞', '1999-10-10', 179, 61, '對角', 'Opposite Hitter', 0, 1),
(247, '邱雅慧', '1998-04-04', 180, 67, '攔中', 'Middle Blocker', 0, 1),
(248, '賴湘程', '1995-03-19', 153, 52, '自由', 'Libero', 0, 1),
(249, '張瓈文', '1995-02-07', 176, 64, '對角', 'Opposite Hitter', 0, 1),
(250, '羅儀璟', '1997-09-16', 160, 55, '自由', 'Libero', 0, 1),
(251, '陳昱潔', '2000-11-12', 176, 58, '長攻', 'Outside Hitter', 0, 1),
(252, '謝苡縥', '1990-09-25', 165, 64, '舉球', 'Setter', 0, 1),
(253, '黃芯瑜', '1998-02-25', 180, 60, '攔中', 'Middle Blocker', 0, 1),
(254, '張秝芸', '1991-03-28', 180, 66, '長攻', 'Outside Hitter', 0, 1),
(255, '劉煜淳', '2000-05-10', 173, 66, '舉球', 'Setter', 0, 1),
(256, '溫以勤', '2001-01-21', 176, 70, '攔中', 'Middle Blocker', 0, 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `Players`
--
ALTER TABLE `Players`
  ADD PRIMARY KEY (`player_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `Players`
--
ALTER TABLE `Players`
  MODIFY `player_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=257;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
